[
  {
    "title": "Mermaid Diagram Renderer - Free Online Tool",
    "desc": "Free online Mermaid diagram renderer - Create and visualize diagrams using Mermaid syntax. Perfect for flowcharts, sequence diagrams, class diagrams, and more",
    "category": "tools",
    "url": "/tools/mermaid-renderer.html"
  },
  {
    "title": "JPG Image Compressor - Free Online Image Optimization Tool",
    "desc": "Free online JPG image compressor - Reduce image file size with adjustable compression and resizing options. Fast, easy-to-use, and works directly in your browser",
    "category": "tools",
    "url": "/tools/image-jpg-compressor.html"
  },
  {
    "title": "Asakusa Kannon Temple Fortune Lots - Draw Your Fortune Online",
    "desc": "Experience the digital version of Asakusa Temple's 100 Fortune Lots (Omikuji). Draw your fortune and receive guidance inspired by the wisdom of Kannon (Guanyin) from the famous Sensoji Temple in Tokyo.",
    "category": "fun",
    "url": "/fun/asakusa-fortune.html"
  },
  {
    "title": "Card Game Score Tracker - Free Online Score Keeper",
    "desc": "Free online card game score tracker - Keep track of scores for your card games. Easy-to-use tool for managing players and recording game scores round by round",
    "category": "fun",
    "url": "/fun/card-game-scorer.html"
  },
  {
    "title": "Subtitle Memer - Free Online Subtitle Meme Generator",
    "desc": "Free online subtitle meme maker - Create funny memes with custom text at the bottom. Easy-to-use meme generator for adding subtitles to images",
    "category": "fun",
    "url": "/fun/subtitle-memer.html"
  },
  {
    "title": "Wordle Random Game - Free Online Word Guessing Game",
    "desc": "Free online Wordle game - Play the classic word guessing game with random words. Try to guess the 5-letter word in six attempts with color-coded feedback",
    "category": "games",
    "url": "/games/wordle.html"
  },
  {
    "title": "Sudoku Game - Free Online Number Puzzle Game",
    "desc": "Free online Sudoku game - Play classic 9x9 Sudoku puzzles with adjustable difficulty. Generate random puzzles and challenge yourself with this brain-training number game",
    "category": "games",
    "url": "/games/sudoku.html"
  }
]