[
  {
    "title": "EXIF Metadata Viewer and Cleaner - Free Online Image Privacy Tool",
    "desc": "Free online EXIF metadata viewer and cleaner - View and remove EXIF data from your images. Protect your privacy by cleaning sensitive metadata from photos before sharing",
    "category": "tools",
    "url": "/tools/image-exif-cleaner.html"
  },
  {
    "title": "Base64 to Image Converter - Free Online Base64 Decoder Tool",
    "desc": "Free online base64 to image converter - Convert base64 strings to image files instantly. Preview and download images from base64 data. Simple and fast conversion tool.",
    "category": "tools",
    "url": "/tools/base64-image.html"
  },
  {
    "title": "Mermaid Diagram Renderer - Free Online Tool",
    "desc": "Free online Mermaid diagram renderer - Create and visualize diagrams using Mermaid syntax. Perfect for flowcharts, sequence diagrams, class diagrams, and more",
    "category": "tools",
    "url": "/tools/mermaid-renderer.html"
  },
  {
    "title": "Free JPG to SVG Converter - Convert Images to Vector Graphics Online",
    "desc": "Free online JPG to SVG converter - Convert your JPEG images to scalable vector graphics (SVG) format. Simple, fast, and free to use.",
    "category": "tools",
    "url": "/tools/image-jpg-svg.html"
  },
  {
    "title": "JPG Image Compressor - Free Online Image Optimization Tool",
    "desc": "Free online JPG image compressor - Reduce image file size with adjustable compression and resizing options. Fast, easy-to-use, and works directly in your browser",
    "category": "tools",
    "url": "/tools/image-jpg-compressor.html"
  },
  {
    "title": "Image Grid Splitter - Free Online 3x3 Grid Image Slicer Tool",
    "desc": "Free online image grid splitter - Split images into 3x3 grids easily. Perfect for social media posts, profile pictures, and creative photo layouts. Simple, fast, and free to use",
    "category": "tools",
    "url": "/tools/image-grid-splitter.html"
  },
  {
    "title": "Milliseconds to Date Converter - Free Online Time Format Tool",
    "desc": "Free online milliseconds to date converter - Convert Unix timestamps and milliseconds to human-readable dates. Features multiple time formats, timezone support, and instant conversion.",
    "category": "tools",
    "url": "/tools/milliseconds-date.html"
  },
  {
    "title": "Video to GIF Converter - Free Online Animation Tool",
    "desc": "Free online video to GIF converter - Convert video files to animated GIFs instantly in your browser. Features customizable frame rate, quality settings, and preview functionality",
    "category": "tools",
    "url": "/tools/video-gif.html"
  },
  {
    "title": "Image Stitcher - Free Online Image Combining Tool",
    "desc": "Free online image stitcher - Combine multiple images horizontally or vertically. Easy-to-use tool with automatic resizing and alignment options. Perfect for creating photo collages and image strips",
    "category": "tools",
    "url": "/tools/image-stitcher.html"
  },
  {
    "title": "Unit Converter - Free Online Length, Area & Volume Conversion Tool",
    "desc": "Free online unit converter - Convert length, area, and volume measurements. Easy-to-use tool with real-time conversion, common presets, and support for metric and imperial units",
    "category": "tools",
    "url": "/tools/unit-converter.html"
  },
  {
    "title": "Image to Base64 Converter - Free Online Image Encoding Tool",
    "desc": "Free online image to base64 converter - Convert images to base64 format instantly. Get base64 strings for HTML img tags, CSS backgrounds, and plain text. Simple and fast conversion tool.",
    "category": "tools",
    "url": "/tools/image-base64.html"
  },
  {
    "title": "Image Color Extractor - Free Online Color Palette Generator",
    "desc": "Free online image color extractor - Analyze and extract dominant colors from your images. Get hex codes, RGB values, and color distribution percentages instantly",
    "category": "tools",
    "url": "/tools/image-color-extractor.html"
  },
  {
    "title": "Network Speed Test - Free Online Internet Connection Speed Test Tool",
    "desc": "Free online network speed test tool - Test your internet connection speed, measure download and upload speeds, latency, and jitter. Simple, accurate, and browser-based testing",
    "category": "tools",
    "url": "/tools/network-speed-test.html"
  },
  {
    "title": "Markdown Renderer - Free Online Markdown to HTML Converter",
    "desc": "Free online markdown renderer - Convert markdown text to HTML with live preview. Customize styles, fonts, and colors. Copy rendered HTML to clipboard easily.",
    "category": "tools",
    "url": "/tools/markdown-html.html"
  },
  {
    "title": "Word to PDF Converter - Free Online Document Conversion Tool",
    "desc": "Free online Word to PDF converter - Convert DOCX files to PDF format directly in your browser. Simple, fast, and secure document conversion tool with preview feature",
    "category": "tools",
    "url": "/tools/word-to-pdf.html"
  },
  {
    "title": "Pixel Art Generator - Free Online Image to Pixel Art Converter",
    "desc": "Free online pixel art generator - Transform your images into pixel art with adjustable pixel size and color palette options. Create retro-style artwork instantly in your browser",
    "category": "tools",
    "url": "/tools/image-pixel-art.html"
  },
  {
    "title": "QR Code Generator - Free Online QR Code Creation Tool",
    "desc": "Free online QR code generator - Create customizable QR codes instantly. Features include real-time preview, size adjustment, color customization, and download options.",
    "category": "tools",
    "url": "/tools/qrcode-generator.html"
  },
  {
    "title": "Image Mosaic Painter - Free Online Photo Pixelation Tool",
    "desc": "Free online image mosaic tool - Create pixelated effects and selectively apply mosaic to images. Paint mosaic areas with mouse, adjust pixel size, and protect sensitive information in photos",
    "category": "tools",
    "url": "/tools/image-mosaic-painter.html"
  },
  {
    "title": "Asakusa Kannon Temple Fortune Lots - Draw Your Fortune Online",
    "desc": "Experience the digital version of Asakusa Temple's 100 Fortune Lots (Omikuji). Draw your fortune and receive guidance inspired by the wisdom of Kannon (Guanyin) from the famous Sensoji Temple in Tokyo.",
    "category": "fun",
    "url": "/fun/asakusa-fortune.html"
  },
  {
    "title": "Card Game Score Tracker - Free Online Score Keeper",
    "desc": "Free online card game score tracker - Keep track of scores for your card games. Easy-to-use tool for managing players and recording game scores round by round",
    "category": "fun",
    "url": "/fun/card-game-scorer.html"
  },
  {
    "title": "Subtitle Memer - Free Online Subtitle Meme Generator",
    "desc": "Free online subtitle meme maker - Create funny memes with custom text at the bottom. Easy-to-use meme generator for adding subtitles to images",
    "category": "fun",
    "url": "/fun/subtitle-memer.html"
  },
  {
    "title": "Online Dice Roller - Free 3D Virtual Dice Rolling Tool",
    "desc": "Free online dice roller - Roll virtual dice with 3D animations. Choose from 1-6 dice, track roll history, and enjoy realistic physics. Perfect for board games, RPGs, and tabletop gaming",
    "category": "life",
    "url": "/life/dice-roller.html"
  },
  {
    "title": "Mortgage Payment Calculator - Free Online Loan Calculator Tool",
    "desc": "Free online mortgage payment calculator - Calculate monthly mortgage payments, total interest, and view amortization schedule. Simple, accurate loan payment calculations with customizable terms",
    "category": "life",
    "url": "/life/mortgage-payment-calculator.html"
  },
  {
    "title": "BMI Calculator - Free Online Body Mass Index Calculator Tool",
    "desc": "Free online BMI (Body Mass Index) calculator - Calculate and track your BMI, understand weight categories, and monitor your health progress. Simple, accurate, and private calculation with historical tracking",
    "category": "life",
    "url": "/life/bmi-calculator.html"
  },
  {
    "title": "Color Code Converter - Free Online RGB/HEX Color Conversion Tool",
    "desc": "Free online color code converter tool - Convert between RGB and HEX color formats with live preview. Features color picker, history tracking, and instant conversion. Browser-based tool with no server interaction",
    "category": "programmer",
    "url": "/programmer/color-code-converter-online.html"
  },
  {
    "title": "SM3 Hash Generator - Free Online Chinese Standard Hash Calculator",
    "desc": "Free online SM3 hash generator - Generate SM3 hashes instantly using China's cryptographic hash algorithm. Secure, browser-based hash generation with no server processing",
    "category": "programmer",
    "url": "/programmer/sm3-encrypt-online.html"
  },
  {
    "title": "DES Encryption Tool - Free Online Text Encryption and Decryption",
    "desc": "Free online DES encryption tool - Encrypt and decrypt text using DES algorithm with multiple modes. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/des-encrypt-online.html"
  },
  {
    "title": "SM2 Encryption Tool - Free Online Chinese Standard Public Key Encryption",
    "desc": "Free online SM2 encryption tool - Encrypt and decrypt text using China's SM2 public key cryptographic algorithm. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/sm2-encrypt-online.html"
  },
  {
    "title": "SM4 Encryption Tool - Free Online Chinese Standard Block Cipher",
    "desc": "Free online SM4 encryption tool - Encrypt and decrypt text using China's SM4 block cipher algorithm. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/sm4-encrypt-online.html"
  },
  {
    "title": "MD5 Hash Generator - Free Online Text to MD5 Converter",
    "desc": "Free online MD5 hash generator - Convert text to MD5 hash instantly with real-time preview. Simple, fast, and secure text to MD5 conversion tool",
    "category": "programmer",
    "url": "/programmer/md5-converter.html"
  },
  {
    "title": "YAML to TOML Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online YAML to TOML converter - Convert YAML data to TOML format instantly. Simple, fast, and accurate YAML to TOML transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/yaml-2-toml.html"
  },
  {
    "title": "JSON to XML Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online JSON to XML converter - Convert JSON data to XML format instantly. Simple, fast, and accurate JSON to XML transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/json-2-xml.html"
  },
  {
    "title": "Crontab Expression Generator - Simple Visual Cron Schedule Editor",
    "desc": "Free online crontab expression generator - Create and validate cron schedule expressions with an interactive interface. Get next run times and human-readable explanations instantly.",
    "category": "programmer",
    "url": "/programmer/cron-schedule-expression-generator.html"
  },
  {
    "title": "Code Formatter - Free Online JSON/HTML/CSS Beautifier Tool",
    "desc": "Free online code formatter tool - Beautify and format JSON, HTML, and CSS code with syntax highlighting. Browser-based processing with no server interaction",
    "category": "programmer",
    "url": "/programmer/code-formatter-online.html"
  },
  {
    "title": "JSON to YAML Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online JSON to YAML converter - Convert JSON data to YAML format instantly. Simple, fast, and accurate JSON to YAML transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/json-2-yaml.html"
  },
  {
    "title": "Regex Tester - Free Online Regular Expression Testing Tool",
    "desc": "Free online regex tester and debugger - Test regular expressions with real-time matching, pattern explanation, and common regex examples. Browser-based processing with no server interaction",
    "category": "programmer",
    "url": "/programmer/regex-tester-online.html"
  },
  {
    "title": "URL Encoder/Decoder - Free Online URL Encoding and Decoding Tool",
    "desc": "Free online URL encoder and decoder tool - Convert URLs to percent-encoded format and decode them back. Secure, browser-based processing with no server interaction",
    "category": "programmer",
    "url": "/programmer/url-encoder-decoder-online.html"
  },
  {
    "title": "JavaScript Minifier - Free Online JS Compression Tool",
    "desc": "Free online JavaScript minifier tool - Compress and optimize JavaScript code instantly. Reduce file size, improve load times, with browser-based processing and no server interaction",
    "category": "programmer",
    "url": "/programmer/js-minifier-online.html"
  },
  {
    "title": "XML to JSON Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online XML to JSON converter - Convert XML data to JSON format instantly. Simple, fast, and accurate XML to JSON transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/xml-2-json.html"
  },
  {
    "title": "RSA Dynamic Code Generator - Free Online Authentication Tool",
    "desc": "Free online RSA dynamic verification code generator and validator - Generate and verify time-based RSA codes with customizable parameters. Secure, browser-based tool with QR code sharing.",
    "category": "programmer",
    "url": "/programmer/rsa-dynamic-code.html"
  },
  {
    "title": "Base Converter - Free Online Number Base Conversion Tool",
    "desc": "Free online number base converter - Convert numbers between binary (base 2), octal (base 8), decimal (base 10), and hexadecimal (base 16). Real-time conversion with no server processing",
    "category": "programmer",
    "url": "/programmer/base-converter-online.html"
  },
  {
    "title": "SHA Hash Generator - Free Online Text to SHA Hash Tool",
    "desc": "Free online SHA hash generator - Generate SHA-1, SHA-256, SHA-384, and SHA-512 hashes instantly. Secure, browser-based hash generation with no server processing.",
    "category": "programmer",
    "url": "/programmer/sha-encrypt-online.html"
  },
  {
    "title": "HTTP Status Code Lookup - Free Online HTTP Response Code Reference Tool",
    "desc": "Free online HTTP status code lookup tool - Quick reference for all HTTP response codes with detailed descriptions, examples, and common use cases. Browser-based tool with instant search",
    "category": "programmer",
    "url": "/programmer/http-status-code-lookup.html"
  },
  {
    "title": "RC Encryption Tool - Free Online RC2/RC4/RC5 Text Encryption and Decryption",
    "desc": "Free online RC encryption tool - Encrypt and decrypt text using RC2, RC4, and RC5 algorithms. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/rc-encrypt-online.html"
  },
  {
    "title": "JSON to TOML Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online JSON to TOML converter - Convert JSON data to TOML format instantly. Simple, fast, and accurate JSON to TOML transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/json-2-toml.html"
  },
  {
    "title": "AES Encryption Tool - Free Online Text Encryption and Decryption",
    "desc": "Free online AES encryption tool - Encrypt and decrypt text using AES-128/192/256 with multiple modes. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/aes-encrypt-online.html"
  },
  {
    "title": "Port Scanner - Free Online Port Scanning Tool",
    "desc": "Free online port scanner tool - Check open ports on a host or IP address with customizable port ranges and common port presets. Browser-based scanning with no server interaction",
    "category": "programmer",
    "url": "/programmer/port-scanner-online.html"
  },
  {
    "title": "YAML to JSON Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online YAML to JSON converter - Convert YAML data to JSON format instantly. Simple, fast, and accurate YAML to JSON transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/yaml-2-json.html"
  },
  {
    "title": "Blowfish Encryption Tool - Free Online Text Encryption and Decryption",
    "desc": "Free online Blowfish encryption tool - Encrypt and decrypt text using Blowfish algorithm with multiple modes. Secure, browser-based encryption with no server processing",
    "category": "programmer",
    "url": "/programmer/blowfish-encrypt-online.html"
  },
  {
    "title": "DOS Game Emulator - Free Online DOS Gaming Experience",
    "desc": "Free online DOS game emulator - Play classic DOS games directly in your browser. Experience retro gaming with this easy-to-use DOS emulator powered by js-dos",
    "category": "games",
    "url": "/games/dos-game-free-online.html"
  },
  {
    "title": "Five in a Row Online - Free Gomoku Game with AI Opponent",
    "desc": "Play Five in a Row (Gomoku) online for free - Challenge our AI opponent in this classic board game. Features move history, undo moves, and a responsive game board. No download required.",
    "category": "games",
    "url": "/games/five-in-a-row-online.html"
  },
  {
    "title": "Wordle Random Game - Free Online Word Guessing Game",
    "desc": "Free online Wordle game - Play the classic word guessing game with random words. Try to guess the 5-letter word in six attempts with color-coded feedback",
    "category": "games",
    "url": "/games/wordle.html"
  },
  {
    "title": "Sudoku Game - Free Online Number Puzzle Game",
    "desc": "Free online Sudoku game - Play classic 9x9 Sudoku puzzles with adjustable difficulty. Generate random puzzles and challenge yourself with this brain-training number game",
    "category": "games",
    "url": "/games/sudoku.html"
  },
  {
    "title": "Tetris - Free Online Classic Block Puzzle Game",
    "desc": "Free online Tetris game - Play the classic block-stacking puzzle game directly in your browser. Features high scores, multiple levels, and responsive controls. No download required",
    "category": "games",
    "url": "/games/tetris-online.html"
  },
  {
    "title": "Chinese Chess (Xiangqi) - Free Online Two-Player Board Game",
    "desc": "Free online Chinese Chess (Xiangqi) game - Play the traditional Chinese board game with a friend. Features include move validation, history tracking, and undo moves",
    "category": "games",
    "url": "/games/chinese-chess-online.html"
  },
  {
    "title": "Niu Niu (Bull Bull) Poker - Free Online Chinese Card Game",
    "desc": "Free online Niu Niu (Bull Bull) poker game - Play the popular Chinese poker game against the dealer. Place bets, make combinations, and aim for Niu Niu (Bull Bull) in this exciting casino card game",
    "category": "games",
    "url": "/games/poker-niuniu-online.html"
  },
  {
    "title": "Black Jack Game - Free Online Casino Card Game",
    "desc": "Free online Black Jack game - Play the classic casino card game with virtual cash. Bet, hit, stand, and double down in this realistic Black Jack simulation",
    "category": "games",
    "url": "/games/black-jack-online.html"
  },
  {
    "title": "Memory Card Game - Free Online Card Matching Game",
    "desc": "Free online memory card game - Test and improve your memory with this fun, interactive card matching game. Features multiple difficulty levels, timer, and score tracking",
    "category": "games",
    "url": "/games/memory-card-game.html"
  },
  {
    "title": "Free Online Angry Birds Style Game - Physics-Based Bird Launcher",
    "desc": "Play free online Angry Birds style game - Launch birds, destroy structures, and defeat pigs in this physics-based game. Simple, fun, and no download required",
    "category": "games",
    "url": "/games/angry-bird-free-online.html"
  }
]