[
  {
    "title": "Mermaid Diagram Renderer - Free Online Tool",
    "desc": "Free online Mermaid diagram renderer - Create and visualize diagrams using Mermaid syntax. Perfect for flowcharts, sequence diagrams, class diagrams, and more",
    "category": "tools",
    "url": "/tools/mermaid-renderer.html"
  },
  {
    "title": "Free JPG to SVG Converter - Convert Images to Vector Graphics Online",
    "desc": "Free online JPG to SVG converter - Convert your JPEG images to scalable vector graphics (SVG) format. Simple, fast, and free to use.",
    "category": "tools",
    "url": "/tools/image-jpg-svg.html"
  },
  {
    "title": "JPG Image Compressor - Free Online Image Optimization Tool",
    "desc": "Free online JPG image compressor - Reduce image file size with adjustable compression and resizing options. Fast, easy-to-use, and works directly in your browser",
    "category": "tools",
    "url": "/tools/image-jpg-compressor.html"
  },
  {
    "title": "Word to PDF Converter - Free Online Document Conversion Tool",
    "desc": "Free online Word to PDF converter - Convert DOCX files to PDF format directly in your browser. Simple, fast, and secure document conversion tool with preview feature",
    "category": "tools",
    "url": "/tools/word-to-pdf.html"
  },
  {
    "title": "Asakusa Kannon Temple Fortune Lots - Draw Your Fortune Online",
    "desc": "Experience the digital version of Asakusa Temple's 100 Fortune Lots (Omikuji). Draw your fortune and receive guidance inspired by the wisdom of Kannon (Guanyin) from the famous Sensoji Temple in Tokyo.",
    "category": "fun",
    "url": "/fun/asakusa-fortune.html"
  },
  {
    "title": "Card Game Score Tracker - Free Online Score Keeper",
    "desc": "Free online card game score tracker - Keep track of scores for your card games. Easy-to-use tool for managing players and recording game scores round by round",
    "category": "fun",
    "url": "/fun/card-game-scorer.html"
  },
  {
    "title": "Subtitle Memer - Free Online Subtitle Meme Generator",
    "desc": "Free online subtitle meme maker - Create funny memes with custom text at the bottom. Easy-to-use meme generator for adding subtitles to images",
    "category": "fun",
    "url": "/fun/subtitle-memer.html"
  },
  {
    "title": "XML to JSON Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online XML to JSON converter - Convert XML data to JSON format instantly. Simple, fast, and accurate XML to JSON transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/xml-2-json.html"
  },
  {
    "title": "YAML to JSON Converter - Free Online Data Format Transformation Tool",
    "desc": "Free online YAML to JSON converter - Convert YAML data to JSON format instantly. Simple, fast, and accurate YAML to JSON transformation tool with syntax highlighting",
    "category": "programmer",
    "url": "/programmer/yaml-2-json.html"
  },
  {
    "title": "DOS Game Emulator - Free Online DOS Gaming Experience",
    "desc": "Free online DOS game emulator - Play classic DOS games directly in your browser. Experience retro gaming with this easy-to-use DOS emulator powered by js-dos",
    "category": "games",
    "url": "/games/dos-game-free-online.html"
  },
  {
    "title": "Wordle Random Game - Free Online Word Guessing Game",
    "desc": "Free online Wordle game - Play the classic word guessing game with random words. Try to guess the 5-letter word in six attempts with color-coded feedback",
    "category": "games",
    "url": "/games/wordle.html"
  },
  {
    "title": "Sudoku Game - Free Online Number Puzzle Game",
    "desc": "Free online Sudoku game - Play classic 9x9 Sudoku puzzles with adjustable difficulty. Generate random puzzles and challenge yourself with this brain-training number game",
    "category": "games",
    "url": "/games/sudoku.html"
  },
  {
    "title": "Black Jack Game - Free Online Casino Card Game",
    "desc": "Free online Black Jack game - Play the classic casino card game with virtual cash. Bet, hit, stand, and double down in this realistic Black Jack simulation",
    "category": "games",
    "url": "/games/black-jack-online.html"
  },
  {
    "title": "Free Online Angry Birds Style Game - Physics-Based Bird Launcher",
    "desc": "Play free online Angry Birds style game - Launch birds, destroy structures, and defeat pigs in this physics-based game. Simple, fun, and no download required",
    "category": "games",
    "url": "/games/angry-bird-free-online.html"
  }
]